{
  "_name_or_path": "bert-base-cased",
  "architectures": [
    "JointIntentSlot"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "alarm_set",
    "1": "audio_volume_mute",
    "2": "iot_hue_lightchange",
    "3": "iot_hue_lightoff",
    "4": "iot_hue_lighton",
    "5": "iot_hue_lightdim",
    "6": "iot_cleaning",
    "7": "calendar_query",
    "8": "play_music",
    "9": "general_quirky",
    "10": "general_greet",
    "11": "datetime_query",
    "12": "datetime_convert",
    "13": "takeaway_query",
    "14": "alarm_remove",
    "15": "alarm_query",
    "16": "news_query",
    "17": "music_likeness",
    "18": "music_query",
    "19": "iot_hue_lightup",
    "20": "takeaway_order",
    "21": "weather_query",
    "22": "music_settings",
    "23": "audio_volume_down",
    "24": "general_joke",
    "25": "music_dislikeness",
    "26": "audio_volume_other",
    "27": "iot_coffee",
    "28": "audio_volume_up",
    "29": "iot_wemo_on",
    "30": "iot_wemo_off",
    "31": "qa_stock",
    "32": "play_radio",
    "33": "social_post",
    "34": "recommendation_locations",
    "35": "cooking_recipe",
    "36": "qa_factoid",
    "37": "recommendation_events",
    "38": "calendar_set",
    "39": "play_audiobook",
    "40": "play_podcasts",
    "41": "social_query",
    "42": "transport_query",
    "43": "email_sendemail",
    "44": "transport_ticket",
    "45": "recommendation_movies",
    "46": "lists_query",
    "47": "play_game",
    "48": "email_query",
    "49": "transport_traffic",
    "50": "cooking_query",
    "51": "qa_definition",
    "52": "calendar_remove",
    "53": "lists_remove",
    "54": "email_querycontact",
    "55": "lists_createoradd",
    "56": "email_addcontact",
    "57": "transport_taxi",
    "58": "qa_maths",
    "59": "qa_currency"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "alarm_query": 15,
    "alarm_remove": 14,
    "alarm_set": 0,
    "audio_volume_down": 23,
    "audio_volume_mute": 1,
    "audio_volume_other": 26,
    "audio_volume_up": 28,
    "calendar_query": 7,
    "calendar_remove": 52,
    "calendar_set": 38,
    "cooking_query": 50,
    "cooking_recipe": 35,
    "datetime_convert": 12,
    "datetime_query": 11,
    "email_addcontact": 56,
    "email_query": 48,
    "email_querycontact": 54,
    "email_sendemail": 43,
    "general_greet": 10,
    "general_joke": 24,
    "general_quirky": 9,
    "iot_cleaning": 6,
    "iot_coffee": 27,
    "iot_hue_lightchange": 2,
    "iot_hue_lightdim": 5,
    "iot_hue_lightoff": 3,
    "iot_hue_lighton": 4,
    "iot_hue_lightup": 19,
    "iot_wemo_off": 30,
    "iot_wemo_on": 29,
    "lists_createoradd": 55,
    "lists_query": 46,
    "lists_remove": 53,
    "music_dislikeness": 25,
    "music_likeness": 17,
    "music_query": 18,
    "music_settings": 22,
    "news_query": 16,
    "play_audiobook": 39,
    "play_game": 47,
    "play_music": 8,
    "play_podcasts": 40,
    "play_radio": 32,
    "qa_currency": 59,
    "qa_definition": 51,
    "qa_factoid": 36,
    "qa_maths": 58,
    "qa_stock": 31,
    "recommendation_events": 37,
    "recommendation_locations": 34,
    "recommendation_movies": 45,
    "social_post": 33,
    "social_query": 41,
    "takeaway_order": 20,
    "takeaway_query": 13,
    "transport_query": 42,
    "transport_taxi": 57,
    "transport_ticket": 44,
    "transport_traffic": 49,
    "weather_query": 21
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.26.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
